app/controllers/admin/products_controller.rb

   def update
     @product = Product.find(params[:id])

     if @product.update(product_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "description" = ?, "quantity" = ?, "price" = ?, "image" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["description", "石彬"], ["quantity", 23], ["price", 23], ["image", "WechatIMG99.jpeg"], ["updated_at", "2020-02-26 11:21:07.996422"], ["id", 2]]

  def create
    @product = Product.new(product_params)

    if @product.save
---
INSERT INTO "products" ("title", "description", "quantity", "price", "created_at", "updated_at", "image") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "1"], ["description", "1"], ["quantity", 1], ["price", 1], ["created_at", "2020-02-26 08:04:28.445182"], ["updated_at", "2020-02-26 08:04:28.445182"], ["image", "WechatIMG99.jpeg"]]