app/controllers/account/orders_controller.rb

    def index
       @orders = current_user.orders.order("id DESC")
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ? ORDER BY id DESC  [["user_id", 1]]

    def pay_with_alipay
        @order = Order.find_by_token(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."token" = ? LIMIT ?  [["token", "fac582f9-f220-474f-8c14-f0bcf68b4c59"], ["LIMIT", 1]]

      def pay_with_wechat
        @order = Order.find_by_token(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."token" = ? LIMIT ?  [["token", "5a91c40a-c51c-4b03-a188-d88b03fdb7ed"], ["LIMIT", 1]]