app/views/carts/checkout.html.erb


        <% current_cart.cart_items.each do |cart_item| %>
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ?  [["cart_id", 1]]