app/views/carts/index.html.erb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ?  [["cart_id", 1]]
---

        <% current_cart.cart_items.each do |cart_item| %>

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
              <%= link_to product_path(cart_item.product) do %>
                <% if cart_item.product.image.present? %>