app/controllers/cart_items_controller.rb

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ? AND "cart_items"."product_id" = ? LIMIT ?  [["cart_id", 1], ["product_id", 1], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 4]]
---
    def destroy
      @cart = current_cart
      @cart_item = @cart.cart_items.find_by(product_id: params[:id])
      @product = @cart_item.product
      @cart_item.destroy

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ? AND "cart_items"."product_id" = ? LIMIT ?  [["cart_id", 1], ["product_id", 1], ["LIMIT", 1]]
UPDATE "cart_items" SET "quantity" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["quantity", 4], ["updated_at", "2020-02-26 10:17:39.091106"], ["id", 6]]
---
    def update
       @cart = current_cart
       @cart_item = @cart.cart_items.find_by(product_id: params[:id])
if @cart_item.product.quantity >= cart_item_params[:quantity].to_i
       @cart_item.update(cart_item_params)