app/controllers/orders_controller.rb

    def create
      @order = Order.new(order_params)
      @order.user = current_user
      @order.total = current_cart.total_price

      if @order.save
        current_cart.cart_items.each do |cart_item|
       product_list = ProductList.new
       product_list.order = @order
       product_list.product_name = cart_item.product.title
       product_list.product_price = cart_item.product.price
       product_list.quantity = cart_item.quantity
       product_list.save
---
INSERT INTO "orders" ("total", "user_id", "billing_name", "billing_address", "shipping_name", "shipping_address", "created_at", "updated_at", "token") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ?  [["cart_id", 1]]
SELECT "product_lists".* FROM "product_lists" WHERE "product_lists"."order_id" = ?  [["order_id", 9]]
INSERT INTO "product_lists" ("order_id", "product_name", "product_price", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["order_id", 2], ["product_name", "1"], ["product_price", 1], ["quantity", 1], ["created_at", "2020-02-26 09:47:08.443335"], ["updated_at", "2020-02-26 09:47:08.443335"]]

    def show
        @order = Order.find_by_token(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."token" = ? LIMIT ?  [["token", "2"], ["LIMIT", 1]]